Catalogs/ФедеральныеВебСервисыЭМД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ФедеральныеВебСервисыЭМД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтносительныйПутьКФайлуЭМД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыРЭМД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>emdrId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пациент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КартотекаРЭМД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПоследнейОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновитьДанныеДокументаВРЭМД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматФайлаДляРЭМД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФорматФайлаДляРЭМД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРЭМД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыМДРегистрируемыхВРЭМД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПоследнейОшибкиИЭМК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокументаИЭМК</Name>
					<Comment>Идентификатор документа указанный в сообщении для ИЭМК</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКонтейнераДокументаИЭМК</Name>
					<Comment>Идентификатор контейнера документа указанный в сообщении для ИЭМК</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправитьВИЭМК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияСодержимогоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭлектронныеПодписиЭМД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОтносительныйПутьКФайлуПодписиЭМД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СотрудникРЭМД</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольРЭМД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиПриПодписанииРЭМД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПодписьМО</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СвязанныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>emdrId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТипаРЭМД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВерсии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодOIDОрганизацииВладельца</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.OIDМедицинскойОрганизации</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияИдентификаторов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>emdrId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПомещенияВИсторию</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ОтложенноеПодписаниеЭП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ОтложенноеПодписаниеЭП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоПодписей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СотрудникРЭМД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РольПриПодписании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиПриПодписанииРЭМД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодписываемыйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФедеральныеВебСервисыЭМД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ФедеральныеВебСервисыЭМД/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)

	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("АктуализироватьСписокОтложенногоПодписания")
		И ЭтотОбъект.ДополнительныеСвойства.АктуализироватьСписокОтложенногоПодписания = Истина
	Тогда
		РегистрыСведений.ОтложенноеПодписаниеЭП.АктуализироватьСписокОтложенногоПодписания(ЭтотОбъект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ)

	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
	
		Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("НеУдалятьПодписиЭМД")
			Или ЭтотОбъект.ДополнительныеСвойства.НеУдалятьПодписиЭМД = Ложь
		Тогда
			Если ЗначениеЗаполнено(ЭтотОбъект.Пациент) Тогда
				ПациентИБ_ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Ссылка, "Пациент");
				Если ЗначениеЗаполнено(ПациентИБ_) И ЭтотОбъект.Пациент <> ПациентИБ_ Тогда
					// Возможно было объединение дублей пациентов, дубль был удален, а в реквизит Пациент поместили верное значение,
					// т.к. в шапке СЭМД присутствуют данные пациента, включая его идентификатор, то возможно требуется пересоздание СЭМД
					// и его подписание.

					ФедеральныеВебСервисыРЭМД.УдалитьЭлектронныеПодписи(ЭтотОбъект);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Определим есть ли изменения в списке ЭП.
		Запрос_ = Новый Запрос;
		Запрос_.Текст =
			"ВЫБРАТЬ
			|	ФедеральныеВебСервисыЭМДЭлектронныеПодписиЭМД.РольРЭМД КАК РольРЭМД,
			|	ФедеральныеВебСервисыЭМДЭлектронныеПодписиЭМД.Сотрудник КАК Сотрудник
			|ИЗ
			|	Справочник.ФедеральныеВебСервисыЭМД.ЭлектронныеПодписиЭМД КАК ФедеральныеВебСервисыЭМДЭлектронныеПодписиЭМД
			|ГДЕ
			|	ФедеральныеВебСервисыЭМДЭлектронныеПодписиЭМД.Ссылка = &Ссылка
			|	И НЕ ФедеральныеВебСервисыЭМДЭлектронныеПодписиЭМД.ЭтоПодписьМО";
		
		Запрос_.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		ПодписиДоЗаписи_ = Запрос_.Выполнить().Выгрузить();
		
		ЭлектронныеПодписиЭМД_ = ЭтотОбъект.ЭлектронныеПодписиЭМД.НайтиСтроки(Новый Структура("ЭтоПодписьМО", Ложь));
		
		Если ПодписиДоЗаписи_.Количество() <> ЭлектронныеПодписиЭМД_.Количество() Тогда
			
			ЭтотОбъект.ДополнительныеСвойства.Вставить("АктуализироватьСписокОтложенногоПодписания", Истина);
			
		ИначеЕсли ЭтотОбъект.ПометкаУдаления <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Ссылка, "ПометкаУдаления") Тогда
		
			ЭтотОбъект.ДополнительныеСвойства.Вставить("АктуализироватьСписокОтложенногоПодписания", Истина);
			
		Иначе
			
			Для Каждого строкаТЧ_ Из ЭлектронныеПодписиЭМД_ Цикл
				Найденные_ = ПодписиДоЗаписи_.НайтиСтроки(Новый Структура("Сотрудник, РольРЭМД", строкаТЧ_.Сотрудник, строкаТЧ_.РольРЭМД));
				
				Если Найденные_.Количество() = 0 Тогда
					ЭтотОбъект.ДополнительныеСвойства.Вставить("АктуализироватьСписокОтложенногоПодписания", Истина);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		ЭтотОбъект.ДополнительныеСвойства.Вставить("АктуализироватьСписокОтложенногоПодписания", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) И ЭтотОбъект.ОбновитьДанныеДокументаВРЭМД = Истина Тогда
		Реквизиты_ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Ссылка, "emdrId,ОбновитьДанныеДокументаВРЭМД");
		
		Если ЭтотОбъект.emdrId <> Реквизиты_.emdrId И ЗначениеЗаполнено(ЭтотОбъект.emdrId)
			И Реквизиты_.ОбновитьДанныеДокументаВРЭМД = Истина
		Тогда
			// Записывается новый emdrId, должно быть документ зарегистрировался в РЭМД.
			ЭтотОбъект.ОбновитьДанныеДокументаВРЭМД = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
